import type {tagRes} from "@/types/tag";

 export const tagListMock = <tagRes[]>[
    {
        id: 1,           // 标签 ID
        name: "测试1标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 2,           // 标签 ID
        name: "测试2标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 3,           // 标签 ID
        name: "测试3标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 4,           // 标签 ID
        name: "测试4标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 0// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 5,           // 标签 ID
        name: "测试5标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 6,           // 标签 ID
        name: "测试6标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 0// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 7,           // 标签 ID
        name: "测试7标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 0// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 8,           // 标签 ID
        name: "测试8标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 9,           // 标签 ID
        name: "测试9标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 10,           // 标签 ID
        name: "测试10标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    },
    {
        id: 11,           // 标签 ID
        name: "测试1标签",         // 标签名称
        created_at: "1746926630", // 创建时间（可选）
        updated_at: "1746926630", // 更新时间（可选）
        examine: 1// 审核状态（0-未通过，1-已通过，默认为1）
    }
]